# MayUnjoinRailAndSupports Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MayUnjoinRailAndSupports Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Fillet may cause the supports unjoin with the rail.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MayUnjoinRailAndSupports { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MayUnjoinRailAndSupports As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MayUnjoinRailAndSupports {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace